Ran Plan for dir: `projects/dev` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.argocd-application.argocd_application.fetch-system-streams will be created
+ resource "argocd_application" "fetch-system-streams" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "fetch-system-streams"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
                name      = null
              + namespace = "fetch-system"
              + server    = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "fetch-system.streams/kustomize/overlays/dev"
              + repo_url        = "https://github.com/goboolean/manifests"
              + target_revision = "main"
            }

          + sync_policy {
              + sync_options = [
                  + "StatusForceHealth=true",
                ]

              + automated {
                  + allow_empty = true
                  + prune       = true
                  + self_heal   = true
                }
            }
        }
    }

  # module.argocd-application.argocd_application.fetch-system-worker will be created
+ resource "argocd_application" "fetch-system-worker" {
      + cascade  = true
      + id       = (known after apply)
      + status   = (known after apply)
      + validate = true
      + wait     = true

      + metadata {
          + generation       = (known after apply)
          + name             = "fetch-system-worker"
          + namespace        = "argocd"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + project                = "default"
          + revision_history_limit = 10

          + destination {
                name      = null
              + namespace = "fetch-system"
              + server    = "https://kubernetes.default.svc"
            }

          + source {
              + path            = "fetch-system.worker/kustomize/overlays/dev"
              + repo_url        = "https://github.com/goboolean/manifests"
              + target_revision = "main"
            }

          + sync_policy {
              + sync_options = [
                  + "StatusForceHealth=true",
                ]

              + automated {
                  + allow_empty = true
                  + prune       = true
                  + self_heal   = true
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d projects/dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.64.35.124/lock?id=goboolean%252Finfrastructure%252Fprojects%252Fdev%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d projects/dev`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
